import 'package:flutter/material.dart';
import 'package:get/get.dart';

class MessageTransaction extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'en_US': {
          'بيت لاهيا': 'Beit Lahia',
          'بيت حانون': 'Beit Hanoun',
          'جباليا': 'Jabalia',
          'الشاطئ': 'Alshaati',
          'غزة': 'Gaza',
          'الزهراء': 'Alzahra',
          'النصيرات': 'Nuseirat',
          'البريج': 'Bureij',
          'المغازي': 'Maghazi',
          'دير البلح': 'Dair Al Balah',
          'خانيونس': 'Khan Younes',
          'عبسان': 'Abasan',
          'رفح': 'Rafah',
          'محافظة': 'Province',
          'المناطق الأثرية الموجودة بها': 'The archaeological areas',
          'المحافظة لا يوجد بها مواقع أثرية':
              'The province has no archaeological sites',
          'الرئيسية': 'Home',
          'ما هي غزة ؟': 'What is Gaza ?',
          'حول التطبيق': 'About The App',
          'اختار المحافظة': 'Choose the Province',
          'المكان': 'The Place',
          'تفاصيل عن المكان': 'Details About Place',
          'اضافة مكان': 'Add Place',
          'الانجليزية': 'English',
          'العربية': 'Arabic',
          'اختيار اللغة': 'Choose Language',
          'ركن فلسطين، وخاصرتها الغربية، نقطة الوصل الدنيا والأخيرة بين بر بلاد الشام والبحر المتوسط ، والبقعة الأكثر تقدما غربا نحو البحر ، في زاوية بين شبه جزيرة سيناء وصحراء النقب والداخل الفلسطيني.نطل على غزة فنطل من فلسطين وفلسطين بلاد كنعان وغزة بلدة كنعانية عربية، بلدة تعتبر من أقدم مدن العالم المأهولة، عبر التاريخ قيل إنها في الألف الرابعة، قبل ميلاد السيد المسيح، وهنالك من قال إن المعينيين هم من بنوها، في القرن الثامن عشر قبل ميلاد المسيح وتتعدد الروايات في هذا الصدد إذ ثمة يرى أنها بنيت قبل ذلك فيقال إنها رابع مدينة بنيت على وجه الأرض.كما سنجد أن ثمة العديد من الروايات التي تحاول أن تفسر معنى اسم غزة، فمنها من رأى أن غزة جمع غازى والغزى والغزاة، الرماة بالنشاب ثم تحولت الى غزة ومٍنها من رأى أن لفظة غزة لغويا تأتي بمعنى قوي ومنيع ومخازن وكنوز وما يدخر.':
              'The western corner of Palestine is the lowest and final link between Br. Balsham and the Mediterranean Sea, the most advanced spot west towards the sea, at an angle between the Sinai Peninsula, and the Negev Desert and the Palestinian interior.One of the oldest inhabited cities in the world in history has been said to be in the fourth thousand, before the birth of Jesus Christ, and there are those who said that they were people who built it. We will also find that there are many accounts that attempt to explain the meaning of the name Gaza. Those who felt that Gaza had brought together invaders, invaders  invaders, the shooters, and then turned to Gaza. Those who felt that the word Gaza was linguistic came with a strong and impervi.',
          'تم إنشاء هذا التطبيق (Antique Gaza) بسبب سياسة الكيان الصهيوني الغاشم في تحريف وتزوير أسماء المعالم والمناطق الأثرية والمحافظات الفلسطينية تحديدا في مدينة غزةفسعينا من خلال هذا التطبيق لإبراز الصورة الصحيحة للعالم بأسره عن الأسماء الحقيقية لتلك المعالم الأثرية.':
              'This application (Antique Gaza) was created because of the Zionist entity\'s wanton policy of misrepresenting and falsifying the names of landmarks, archaeological areas and specifically Palestinian governorates in Gaza City.Through this application, we have sought to project the true world picture of the real names and location of those monuments.',
          'اغلاق': 'Close',
          'الرجاء ملئ الحقل': 'Please fill the TextField',
          'اضافة المكان': 'Add The Place',
          'المحافظات': 'Provinces',
          'اللغة': 'Language',
          'تم تسجيل المكان بنجاح': 'Success Add Place',
        },
        'ar_Ar': {
          'بيت لاهيا': 'بيت لاهيا',
          'بيت حانون': 'بيت حانون',
          'جباليا': 'جباليا',
          'الشاطئ': 'الشاطئ',
          'غزة': 'غزة',
          'الزهراء': 'الزهراء',
          'النصيرات': 'النصيرات',
          'البريج': 'البريج',
          'المغازي': 'المغازي',
          'دير البلح': 'دير البلح',
          'خانيونس': 'خانيونس',
          'عبسان': 'عبسان',
          'رفح': 'رفح',
          'محافظة': 'محافظة',
          'المناطق الأثرية الموجودة بها': 'المناطق الأثرية الموجودة بها',
          'المحافظة لا يوجد بها مواقع أثرية':
              'المحافظة لا يوجد بها مواقع أثرية',
          'الرئيسية': 'الرئيسية',
          'ما هي غزة؟': 'ما هي غزة؟',
          'حول التطبيق': 'حول التطبيق',
          'اختار المحافظة': 'اختار المحافظة',
          'المكان': 'المكان',
          'تفاصيل عن المكان': 'تفاصيل عن المكان',
          'اضافة مكان': 'اضافة مكان',
          'الانجليزية': 'الانجليزية',
          'العربية': 'العربية',
          'اختيار اللغة': 'اختيار اللغة',
          'ركن فلسطين، وخاصرتها الغربية، نقطة الوصل الدنيا والأخيرة بين بر بلاد الشام والبحر المتوسط ، والبقعة الأكثر تقدما غربا نحو البحر ، في زاوية بين شبه جزيرة سيناء وصحراء النقب والداخل الفلسطيني.نطل على غزة فنطل من فلسطين وفلسطين بلاد كنعان وغزة بلدة كنعانية عربية، بلدة تعتبر من أقدم مدن العالم المأهولة، عبر التاريخ قيل إنها في الألف الرابعة، قبل ميلاد السيد المسيح، وهنالك من قال إن المعينيين هم من بنوها، في القرن الثامن عشر قبل ميلاد المسيح وتتعدد الروايات في هذا الصدد إذ ثمة يرى أنها بنيت قبل ذلك فيقال إنها رابع مدينة بنيت على وجه الأرض.كما سنجد أن ثمة العديد من الروايات التي تحاول أن تفسر معنى اسم غزة، فمنها من رأى أن غزة جمع غازى والغزى والغزاة، الرماة بالنشاب ثم تحولت الى غزة ومٍنها من رأى أن لفظة غزة لغويا تأتي بمعنى قوي ومنيع ومخازن وكنوز وما يدخر':
              'ركن فلسطين، وخاصرتها الغربية، نقطة الوصل الدنيا والأخيرة بين بر بلاد الشام والبحر المتوسط ، والبقعة الأكثر تقدما غربا نحو البحر ، في زاوية بين شبه جزيرة سيناء وصحراء النقب والداخل الفلسطيني.نطل على غزة فنطل من فلسطين وفلسطين بلاد كنعان وغزة بلدة كنعانية عربية، بلدة تعتبر من أقدم مدن العالم المأهولة، عبر التاريخ قيل إنها في الألف الرابعة، قبل ميلاد السيد المسيح، وهنالك من قال إن المعينيين هم من بنوها، في القرن الثامن عشر قبل ميلاد المسيح وتتعدد الروايات في هذا الصدد إذ ثمة يرى أنها بنيت قبل ذلك فيقال إنها رابع مدينة بنيت على وجه الأرض.كما سنجد أن ثمة العديد من الروايات التي تحاول أن تفسر معنى اسم غزة، فمنها من رأى أن غزة جمع غازى والغزى والغزاة، الرماة بالنشاب ثم تحولت الى غزة ومٍنها من رأى أن لفظة غزة لغويا تأتي بمعنى قوي ومنيع ومخازن وكنوز وما يدخر',
          'تم إنشاء هذا التطبيق (Antique Gaza) بسبب سياسة الكيان الصهيوني الغاشم في تحريف وتزوير أسماء المعالم والمناطق الأثرية والمحافظات الفلسطينية تحديدا في مدينة غزةفسعينا من خلال هذا التطبيق لإبراز الصورة الصحيحة للعالم بأسره عن الأسماء الحقيقية لتلك المعالم الأثرية.':
              'تم إنشاء هذا التطبيق (Antique Gaza) بسبب سياسة الكيان الصهيوني الغاشم في تحريف وتزوير أسماء المعالم والمناطق الأثرية والمحافظات الفلسطينية تحديدا في مدينة غزةفسعينا من خلال هذا التطبيق لإبراز الصورة الصحيحة للعالم بأسره عن الأسماء الحقيقية لتلك المعالم الأثرية.',
          'اغلاق': 'اغلاق',
          'اللغة': 'اللغة',
          'تم تسجيل المكان بنجاح': 'تم تسجيل المكان بنجاح',
        },
      };
}
